
[A_DispelMagic H7HeroAbility]
mName="Рассеивание магии"
mTooltip="Мгновенно рассеивает все магические эффекты, наложенные на отряд."
mTooltipUpgraded="Мгновенно рассеивает все магические эффекты на отрядах в выбранной области 3x3."
mTooltipMagicGuild="Мгновенно рассеивает все магические эффекты, наложенные на отряд."
mTooltipMagicGuildRankLine="затраты %ICON_MANA маны: %special6 ед."
[A_Implosion H7HeroAbility]
mName="Коллапс"
mTooltip="Мгновенно наносит урон от %d.icon изначальной магии в размере %d от запаса здоровья всех существ в отряде и притягивает к нему все отряды, находящиеся на расстоянии до 3 клеток."
mTooltipMagicGuild="Мгновенно наносит урон от %d.icon изначальной магии в размере процента от запаса здоровья всех существ в отряде и притягивает к нему все отряды, находящиеся на расстоянии до 3 клеток."
mTooltipUpgraded="Мгновенно наносит урон от %d.icon изначальной магии в размере %d от запаса здоровья всех существ в отряде и притягивает к нему все отряды, находящиеся на расстоянии до 3 клеток. В начале следующего раунда заклинание срабатывает повторно с рангом навыка, повышенным до уровня знатока."
mTooltipMagicGuildRankLine="%d от зд. всех существ в отряде"
[A_TimeControl H7HeroAbility]
mName="Управление временем"
mTooltip="Увеличивает %buff1.buff.stat.icon инициативу выбранного дружественного отряда на %buff1.buff.stat.norm или снижает %buff2.buff.stat.icon инициативу выбранного вражеского отряда на %buff2.buff.stat.norm. Длительность (ходов): %buff1.buff.durini."
mTooltipMagicGuild="Увеличивает %buff1.buff.stat.icon инициативу выбранного дружественного отряда или снижает %buff2.buff.stat.icon инициативу выбранного вражеского отряда. Длительность (ходов): %buff1.buff.durini."
mTooltipUpgraded="Изменяет %buff1.buff.stat.icon инициативу всех отрядов в выбранной области 4x4. %buff1.buff.stat к %buff1.buff.stat.icon инициативе дружественных отрядов. %buff2.buff.stat к %buff2.buff.stat.icon инициативе вражеских отрядов. Длительность (ходов): %buff1.buff.durini."
mTooltipMagicGuildRankLine="%ICON_INITIATIVE инициатива: +%buff1.buff.stat.norm (союзники), -%buff1.buff.stat.norm (противники)"
[A_TimeControl_Buff_Fast H7BaseBuff]
mName="Ускорение времени"
mTooltip="%stat к %stat.icon инициативе.\nДлительность (ходов): %durnow."
[A_TimeControl_Buff_Slow H7BaseBuff]
mName="Замедление времени"
mTooltip="%stat к %stat.icon инициативе.\nДлительность (ходов): %durnow."
[A_TimeStasis H7HeroAbility]
mName="Остановка времени"
mTooltip="Отряд не может двигаться или атаковать, а союзники и противники не могут с ним взаимодействовать. Однако эффект заклинания – %buff1.buff.name – можно рассеять.\nДействует до начала следующего раунда."
mTooltipMagicGuild="Отряд не может двигаться или атаковать, а союзники и противники не могут с ним взаимодействовать. Однако эффект заклинания – %buff1.buff.name – можно рассеять.\nДействует до начала следующего раунда."
mTooltipMagicGuildRankLine="затраты %ICON_MANA маны: %special1 ед."
[A_TimeStasis_Buff H7BaseBuff]
mName="Остановка времени"
mTooltip="Отряд не может двигаться или атаковать, а союзники и противники не могут с ним взаимодействовать. Однако эффект заклинания – %name – можно рассеять.\nДействует до начала следующего раунда."
[A_Fortune H7HeroAbility]
mName="Фортуна"
mTooltip="%buff.buff.stat.icon Удача выбранного дружественного отряда повышена на %buff.buff.stat.norm. Длительность (ходов): %buff.buff.durini."
mTooltipMagicGuild="%buff.buff.stat.icon Удача выбранного дружественного отряда повышена. Длительность (ходов): %buff.buff.durini."
mTooltipUpgraded="%buff.buff.stat.icon Удача всех дружественных отрядов в выбранной области 4x4 повышается на %buff.buff.stat.norm. Длительность (ходов): %buff.buff.durini."
mTooltipMagicGuildRankLine="%buff.buff.stat к %ICON_LUCK удаче"
[A_Fortune_Buff H7BaseBuff]
mName="Фортуна"
mTooltip="%stat к %stat.icon удаче.\nДлительность (ходов): %durnow."
[A_InstantRecall H7HeroAbility]
mName="Возврат в город"
mTooltip="Мгновенно переносит героя и его армию в ближайший союзный город с порталом."
[A_InstantReinforcements H7HeroAbility]
mName="Призыв подкреплений"
mTooltip="Мгновенно переносит к герою выбранных существ из ближайшего дружественного города с порталом. Расход маны зависит от размера подкреплений. Это заклинание нельзя использовать для перемещения между поверхностью и подземельем."
[A_SummonElemental H7HeroAbility]
mName="Призыв элементалей"
mTooltip="Мгновенно призывает в выбранную область 2x2 элементалей случайной стихии – %special1.val1 сущ."
mTooltipMagicGuild="Мгновенно призывает на поле боя элементалей случайной стихии."
mTooltipUpgraded="Мгновенно призывает в выбранную область 2x2 элементалей случайной стихии – %special1.val1 сущ. В начале следующего раунда к призванному отряду добавляются еще %special9 от изначального количества призванных элементалей."
mTooltipMagicGuildRankLine="призыв элементалей – %special1.val1 сущ."
[A_Teleport_Buff H7BaseBuff]
mName="Прыжок во времени"
mTooltip="%stat к %stat.icon инициативе\nДлительность (ходов): %durnow."
[A_RevealTreasure H7HeroAbility]
mName="Обнаружить сокровище"
mTooltip="Позволяет обнаружить Слезу Асхи, если она спрятана в том месте, где находится герой, использующий заклинание, или в одной клетке от него. Использует все оставшиеся очки хода."
[Imprinted.A_Implosion_Imprinted H7HeroAbility]
mName="Коллапс"
mTooltip="Мгновенно наносит урон от %d.icon изначальной магии в размере %d от запаса здоровья всех существ в отряде и притягивает к нему все отряды, находящиеся на расстоянии до 3 клеток."
[A_TimeControl_FromCreature_Buff_Slow_Elite H7BaseBuff]
mName="Замедление времени"
mTooltip="%stat к %stat.icon инициативе.\nДлительность (ходов): %durnow."
[A_Implosion_Buff H7BaseBuff]
mName="Эхо коллапса"
mTooltip="В начале следующего раунда «Коллапс» срабатывает еще раз и наносит урон от %d.icon изначальной магии в размере %d от максимального запаса здоровья всех существ в отряде."
[A_TimeControl_FromCreature_Buff_Slow_Champion H7BaseBuff]
mName="Замедление времени"
mTooltip="%stat к %stat.icon инициативе.\nДлительность (ходов): %durnow."
[A_SummonElemental_Buff H7BaseBuff]
mName="Эхо призыва элементалей"
mTooltip="Если отряд не уничтожен до начала следующего раунда, к нему добавляются еще %special1 от изначального количества призванных элементалей."
[Imprinted.A_TimeControl_Imprinted H7HeroAbility]
mTooltipMagicGuild="Увеличивает %buff1.buff.stat.icon инициативу выбранного дружественного отряда или снижает %buff2.buff.stat.icon инициативу выбранного вражеского отряда. Длительность (ходов): %buff1.buff.durini."
mTooltipUpgraded="Изменяет %buff1.buff.stat.icon инициативу всех отрядов в выбранной области 4x4. Увеличивает %buff1.buff.stat.icon инициативу дружественных отрядов на %buff1.buff.stat.norm и снижает %buff2.buff.stat.icon инициативу вражеских отрядов на %buff2.buff.stat.norm. Длительность (ходов): %buff1.buff.durini."
mName="Управление временем"
mTooltip="Увеличивает %buff1.buff.stat.icon инициативу выбранного дружественного отряда на %buff1.buff.stat.norm или снижает %buff2.buff.stat.icon инициативу выбранного вражеского отряда на %buff2.buff.stat.norm. Длительность (ходов): %buff1.buff.durini."
[Imprinted.A_TimeControl_Imprinted_Buff_Fast H7BaseBuff]
mName="Ускорение времени"
mTooltip="%stat к %stat.icon инициативе.\nДлительность (ходов): %durnow."
[Imprinted.A_TimeControl_Imprinted_Buff_Slow H7BaseBuff]
mName="Замедление времени"
mTooltip="%stat к %stat.icon инициативе.\nДлительность (ходов): %durnow."
[Imprinted.A_DispelMagic_Imprinted H7HeroAbility]
mName="Рассеивание магии"
mTooltip="Мгновенно рассеивает все магические эффекты, наложенные на отряд."
[Imprinted.A_Fortune_Imprinted_Buff H7BaseBuff]
mName="Фортуна"
mTooltip="%stat к %stat.icon удаче.\nДлительность (ходов): %durnow."
[Imprinted.A_InstantRecall_Imprinted H7HeroAbility]
mName="Возврат в город"
mTooltip="Мгновенно переносит героя и его армию в ближайший союзный город с порталом."
[Imprinted.A_Fortune_Imprinted H7HeroAbility]
mName="Фортуна"
mTooltip="%buff.buff.stat.icon Удача выбранного дружественного отряда повышена на %buff.buff.stat.norm. Длительность (ходов): %buff.buff.durini."
[Imprinted.A_TimeStasis_Imprinted H7HeroAbility]
mName="Остановка времени"
mTooltip="Отряд не может двигаться или атаковать, а союзники и противники не могут с ним взаимодействовать. Однако эффект заклинания – %buff1.buff.name – можно рассеять.\nДействует до начала следующего раунда."
[A_SummonElemental_Buff_WeekOfElementals H7BaseBuff]
mName="Неделя элементалей"
mTooltip="Количество призываемых элементалей увеличивается на %special1."
[Imprinted.A_SoulConflagration_Imprinted H7HeroAbility]
mName="Испепеление души"
mTooltip="Все вражеские существа в выбранной области 4x4 получают %d.min ед. урона от %icon_prime изначальной магии, а затем %special от полученного урона за каждый дружественный отряд в области действия заклинания."
[Imprinted.A_Implosion_Imprinted_Artifact H7HeroAbility]
mName="Коллапс"
mTooltip="Мгновенно наносит урон от %d.icon изначальной магии в размере %d от запаса здоровья всех существ в отряде и притягивает к нему все отряды, находящиеся на расстоянии до 3 клеток."
[A_SoulConflagration H7HeroAbility]
mTooltipMagicGuild="Все вражеские существа в выбранной области 4x4 получают урон от изначальной магии, а затем некоторый процент от полученного урона за каждый дружественный отряд в области действия заклинания."
mTooltipMagicGuildRankLine="%d.min ед. урона от %icon_prime изначальной магии и еще %special за кажд. дружеств. отряд."
mName="Испепеление души"
mTooltip="Все вражеские существа в выбранной области 4x4 получают %d.min ед. урона от %icon_prime изначальной магии, а затем еще %special от полученного урона за каждый дружественный отряд в области действия заклинания."

UCP 1.2
[A_Teleport H7HeroAbility]
mName="Мгновенное перемещение"
mTooltip="Дружественный отряд мгновенно переносится на свободную позицию в пределах %special кл."
mTooltipMagicGuild="Дружественный отряд мгновенно переносится на свободную позицию в пределах нескольких клеток."
mTooltipUpgraded="Дружественный отряд мгновенно переносится на свободную позицию в пределах %special кл. Его %buff1.buff.stat.icon инициатива увеличивается на %buff1.buff.stat.norm. Эффект действует в течение %buff1.buff.durini хода(ов)."
mTooltipMagicGuildRankLine="действ. в пределах %special кл."

[Imprinted.A_Teleport_Imprinted H7HeroAbility]
mName="Мгновенное перемещение"
mTooltip="Дружественный отряд мгновенно переносится на свободную позицию в пределах %special кл."

UCP 1.3

[Imprinted.A_SummonElemental_Imprinted_Artifact H7HeroAbility]
mName="Призыв элементалей"
mTooltip="Мгновенно призывает в выбранную область 2x2 элементалей случайной стихии – %special1.val1 сущ."

[Imprinted.A_SummonElemental_Imprinted H7HeroAbility]
mName="Призыв элементалей"
mTooltip="Мгновенно призывает в выбранную область 2x2 элементалей случайной стихии – %special1.val1 сущ."